Revit 2027 API
FabricationPartBrowserOperation Enumeration
 Operations for the FabricationPartBrowserChangedEventArgs Event
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FabricationPartBrowserOperation
Public Enumeration FabricationPartBrowserOperation
public enum class FabricationPartBrowserOperation
type FabricationPartBrowserOperation
Members
Member name | Value | Description
CreatedRoutingSolutions | 4 |  Routing solutions (re)created
DisplayPartBrowserForCurrentViewport | 16 |  Enable or disable the display of the fabrication part browser for the current view port.
FinishMPRoutingMode | 8 |  Finish multi-point routing mode
FinishRoutingSolutionMode | 6 |  Finish routing solution mode
FinishServiceSwapOutMode | 10 |  Finish service swap-out mode
FinishSizeSwapOutMode | 14 |  Finish size swap out mode.
HideBrowser | 1 |  Hide browser window
RoutingSolutionChanged | 5 |  Active Routing solution has changed
ShowBrowser | 0 |  Show browser window
ShowService | 2 |  Select current service
StartMPRoutingMode | 7 |  Start multi-point routing mode
StartRoutingSolutionMode | 3 |  Start routing solution mode
StartServiceSwapOutMode | 9 |  Start service swap-out mode
StartSizeSwapOutMode | 13 |  Start size swap-out mode.
SwitchToInlineFittingsTab | 15 |  Make the inline fittings tab active in Change Service.
UnknownOperation | -1 |  Unknown operation
UpdateServiceSwapOutPartTypes | 11 |  Service swap out part type mappings has changed.
UpdateServiceSwapOutSizes | 12 |  Service swap out size mappings has changed.
See Also
Reference
Autodesk.Revit.UI.Events Namespace